part/test-for-petsc4foam/tuning/mixerVessel2D/original/0.orig/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class volScalarField;
    object alpha.air;
}

dimensions [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField {
    rotor {
        type zeroGradient;
    }
    stator {
        type zeroGradient;
    }
    front {
        type empty;
    }
    back {
        type empty;
    }
}
