part/test-for-petsc4foam/tuning/mixerVessel2D/original/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object MRFProperties;
}

MRF1 {
    cellZone rotor;
    active yes;
    // Fixed patches (by default they 'move' with the MRF zone)
    nonRotatingPatches ();
    origin (0 0 0);
    axis (0 0 1);
    omega constant 2.2831853;
}
