part/test-for-petsc4foam/tuning/mixerVessel2D/original/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object fvSchemes;
}

ddtSchemes {
    default Euler;
}
gradSchemes {
    default Gauss linear;
}
divSchemes {
    div(rhoPhi,U) Gauss limitedLinearV 1;
    div(phi,alpha) Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,T) Gauss limitedLinear 1;
}
laplacianSchemes {
    default Gauss linear corrected;
}
interpolationSchemes {
    default linear;
}
snGradSchemes {
    default corrected;
}
