part/test-for-petsc4foam/tuning/mixerVessel2D/original/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers {
    "alpha.*" {
        nAlphaCorr 4;
        nAlphaSubCycles 4;
        cAlpha 1;
    }
    "pcorr.*" {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-10;
        relTol 0;
    }
    p_rgh {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-07;
        relTol 0.05;
    }
    p_rghFinal {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-07;
        relTol 0;
    }
    "(U|T).*" {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-08;
        relTol 0;
    }
}
PIMPLE {
    momentumPredictor no;
    nCorrectors 4;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}
relaxationFactors {
    equations {
        ".*" 1;
    }
}
