part/test-for-petsc4foam/tuning/mixerVessel2D/original/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions (
    {
        name rotor;
        type cellSet;
        action new;
        source zoneToCell;
        zone rotor;
    }
);
